---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs.Options
source: html/7aa7c50c-37cb-ca2c-76c5-860a00b527b4.htm
---
# Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs.Options Property

User's options associated with the synchronization operation.

## Syntax (C#)
```csharp
public SynchronizeWithCentralOptions Options { get; }
```